In [13]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns


df = pd.read_csv(r"C:\Users\OJ 001\Downloads\sample_preprocessing_dataset.csv")

In [15]:
df.columns

Index(['ID', 'Name', 'Age', 'Gender', 'Department', 'Salary', 'Experience',
       'JoinedDate'],
      dtype='object')

In [25]:
#Dropping duplicates from the data
df=df.drop_duplicates()

In [27]:
#checking for missing values
df.isnull().sum()

ID             0
Name           0
Age           15
Gender         0
Department     0
Salary        10
Experience     0
JoinedDate     0
dtype: int64

In [43]:
#filling missing values using simple imputer

from sklearn.impute import SimpleImputer
cols_to_impute = ['Age', 'Salary']

# Create SimpleImputer (e.g., using mean strategy)
imputer = SimpleImputer(strategy='mean')

# Fit and transform the selected columns
df[cols_to_impute] = imputer.fit_transform(df[cols_to_impute])
df[['Age', 'Salary']] = df[['Age', 'Salary']].round(0).astype(int)

In [45]:
#printing the first 10 rows to check if missing values have been handled for Age and Salary column
df.head(10)

    ID     Name  Age  Gender Department  Salary  Experience  JoinedDate
0   16    Diana   22    Male  Marketing   48574           4    3/8/2015
1   10      Eve   23    Male  Marketing   44060           9   2/28/2018
2  101      Eve   24    Male         HR   43224          13   5/10/2023
3  133    Frank   56    Male      Sales   32482           8   3/22/2024
4   69      Bob   56    Male         HR   86942           4    1/6/2023
5   96    Diana   35  Female         HR   98244          10    8/9/2020
6  160    Diana   34  Female         HR   82603           2  11/11/2015
7  163      Eve   41  Female      Sales   63750           7   1/21/2015
8  148      Eve   23    Male      Sales   36645           4   2/14/2024
9  183  Charlie   54    Male      Sales   90500           8    8/9/2016

In [49]:
df.to_excel('cleaned_sampledata2.xlsx', index=False)